#+TITLE Test: Map Cells with Paths
# d:/projects/dungeon-mode/t/org/maps-01_cell-path.org

This tests map rendering using a single table and column.

* Cells
:PROPERTIES:
:ETL: cell
:END:

| x | y | path                                                                     |
| 1 | 1 | h1 v.43 a.07,.07,0,1,1,0,.14 a.07,.07,0,1,1,0,-.14 m0,.14 v.43 m-1,0 v-1 |

* Test

#+BEGIN_SRC emacs-lisp
  (let ((dm-map-files (list (buffer-file-name)))
        (dm-map-level-size (cons 3 3))
        (dm-map-draw-other-props nil)
        (dm-map-background '(nil))
	(dm-map-draw-attributes
	 '(path ((fill . "none")
		 (stroke . "#f0f")
		 (stroke-width . "1")))))
    (prin1-to-string (list 'image (dm-map-draw t)
                           'tiles dm-map-tiles
			   'level dm-map-level)))
#+END_SRC

#+RESULTS:
: (image #s(dm-svg (svg ((width . 311) (height . 311) (version . "1.1") (xmlns . "http://www.w3.org/2000/svg") (stroke . white) (stroke-width . 1) (:image . #<marker at 49 in **dungeon map**>)) nil (path ((d . "M 137 137 h 37 v 15.91 a 0.07 0.07 0 1 1 0 5 a 0.07 0.07 0 1 1 0 -5 m 0 5 v 15.91 m -37 0 v -37") (fill . "none") (stroke . "#f0f") (stroke-width . "1")))) (path ((d . "M 137 137 h 37 v 15.91 a 0.07 0.07 0 1 1 0 5 a 0.07 0.07 0 1 1 0 -5 m 0 5 v 15.91 m -37 0 v -37") (fill . "none") (stroke . "#f0f") (stroke-width . "1")))) tiles #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data ()) level #s(hash-table size 65 test equal rehash-size 1.5 rehash-threshold 0.8125 data ((1 . 1) (path ((h (1)) (v (0.43)) (a (0.07 0.07 0 1 1 0 0.14)) (a (0.07 0.07 0 1 1 0 -0.14)) (m (0 0.14)) (v (0.43)) (m (-1 0)) (v (-1)))))))
